** Sort files and copy (2d)

This script relies on the dataset SCHAEFFER that should be extracted at ../../dataset/SCHAEFFER/ relative to this script. The dataset may be downloaded from https://www.kaggle.com/datasets/maurizioberta/test-schaeffer?resource=download

This script parses through the SCHAEFFER dataset and looks for the keywords in the variables keyA and keyB. It goes through the following steps:
1. clear the directories defined by dirA and dirB
2. loop through the directories in the SCHEAFFER set
3. loops through the json in each directory and parses it for keyA and keyB
4. copies over the found files to the respective directory in /Volumes/Freedom/Dropbox/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/classification/training_data
5. closes open files

To find additional classifiers its easy to run the script with different key words. Beware of multi word keys which has not been tested.

#+begin_src shell :results output :tangle ./import_data.sh
  #!/bin/bash
  dataset="../../dataset/SCHAEFFER/"
  keyA=Impulse
  keyB=Iteration
  base="../classification/training_data/"
  dirA="$base""$keyA"
  dirB="$base""$keyB"

  echo "Clearing directories...\n\n"
  rm -rf $dirB/*.wav
  rm -rf $dirA/*.wav

  echo "Copying files from dataset...\n\n"
  for d in "$dataset"*/; do
      for j in "$d"*.json; do
  	if test -f "$j"
  	then
  	    if [[ "$(cat "$j" | jq '.object.labels.sustain')" == "\""$keyB"\"" ]]; then
  		if [ ! -d "$dirB" ]; then
  		    mkdir "$dirB"
  		fi
  		cp "$d""`cat "$j" | jq -r '.object.filename'`" "$dirB"
  	    fi
  	    if [[ "$(cat "$j" | jq '.object.labels."pulse-typology"')" == "\""$keyA"\"" ]]; then
  		if [ ! -d "$dirA" ]; then
  		    mkdir "$dirA"
  		fi
  		cp "$d""`cat "$j" | jq -r '.object.filename'`" "$dirA"
  	    fi
  	fi
      done
  done

  echo "Done!\n"
#+end_src

#+RESULTS:
: Clearing directories...\n\n
: Copying files from dataset...\n\n
: Done!\n

*** Script

This script relies on the dataset SCHAEFFER that should be extracted at ../../dataset/SCHAEFFER/ relative to this script. The dataset may be downloaded from https://www.kaggle.com/datasets/maurizioberta/test-schaeffer?resource=download

This script parses through the SCHAEFFER dataset and looks for the keywords in the variables keyA and keyB. It goes through the following steps:
1. clear the directories defined by dirA and dirB
2. loop through the directories in the SCHEAFFER set
3. loops through the json in each directory and parses it for keyA and keyB
4. copies over the found files to the respective directory in /Volumes/Freedom/Dropbox/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/classification/training_data
5. closes open files

To find additional classifiers its easy to run the script with different key words. Beware of multi word keys which has not been tested.

#+begin_src shell :results output :tangle ./import_main.sh :noweb yes
    #!/bin/bash
    dataset="../../dataset/SCHAEFFER/"

    harmsus=("HarmSus" "Harmonic sound" "Sinsoidal sound" "Flat sustain")
    harmimp=("HarmImp" "Harmonic sound" "Sinsoidal sound" "Impulse")
    harmiter=("HarmIter" "Harmonic sound" "Sinusoidal sound" "Iteration" "Regular pulse train")
    
    noisesus=("NoiseSus" "Noisy sound" "Noise" "Flat sustain")
    noiseimp=("NoiseImp" "Noisy sound" "Noise" "Impulse")
    noiseiter=("NoiseIter" "Noisy sound" "Noise" "Flat sustain"  "Regular pulse train")
    
    vacillatingsus=("CompositeSus" "Composite or Stratified sound" "Vacillating sustain" "Flat sustain")
    compositeimp=("CompositeImp" "Vacillating sustain" "Composite or Stratified sound" "Impulse")
    compositeiter=("CompositeIter" "Vacillating sustain" "Composite or Stratified sound" "Regular pulse train" "Iteration")
    base="../classification/training_data"


    echo $base/${harmsus[0]}
    # echo "Clearing directories...\n"
    # for directory in keyA keyB keyC keyD keyE keyF keyG keyH keyI
    # do
    #     rm -rf $d/*.wav
    # done

    echo "Copying files from dataset...\n\n"
    for d in "$dataset"*/; do
        for j in "$d"*.json; do
            if test -f "$j"
            then
  #  	    <<harmonic_row>>
  #   	    <<noise_row>>
               <<vacillating_row>>
            fi
        done
    done

    echo "Done!\n"
#+end_src

#+RESULTS:
: ../classification/training_data/HarmSus
: Copying files from dataset...\n\n
: Done!\n

#+name: harmonic_row
#+begin_src shell :results outpu :n oweb yes

  ##############################
    # Harmonic sustain
    if [ ! -d "$base/${harmsus[0]}" ]; then
        mkdir "$base/${harmsus[0]}"
    fi
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmsus[1]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${harmsus[3]} ]]; then
        #  		echo "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmsus[0]}
    fi
    # Harmonic sustain (Sinusoidal)
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmsus[2]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${harmsus[3]} ]]; then
        # echo "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmsus[0]}
    fi
    ##############################
    # Harmonic impulse
    if [ ! -d "$base/${harmimp[0]}" ]; then
        mkdir "$base/${harmimp[0]}"
    fi
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmimp[1]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${harmimp[3]} ]]; then
        #        		echo "HarmImp" "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmimp[0]}
    fi
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmimp[2]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${harmimp[3]} ]]; then
        # echo "HarmImp" "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmimp[0]}
    fi
    ##############################
    # Harmonic iteration
    if [ ! -d "$base/${harmiter[0]}" ]; then
        mkdir "$base/${harmiter[0]}"
    fi
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmiter[1]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${harmiter[3]} ]]; then

        # echo "Harmiter0" "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmiter[0]}
    fi
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmiter[2]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${harmiter[3]} ]]; then
        # echo "HarmIter1" "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmiter[0]}
    fi
    if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${harmiter[1]} ]] &&
    	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${harmiter[4]} ]]; then
        # echo "HarmIter2" "$d""`cat "$j" | jq -r '.object.filename'`"
        cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${harmiter[0]}
    fi
#+end_src

#+name: noise_row
#+begin_src shell :results output :noweb yes
  ##############################
  # Noise sustain
  if [ ! -d "$base/${noisesus[0]}" ]; then
      mkdir "$base/${noisesus[0]}"
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${noisesus[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${noisesus[3]} ]]; then
      # echo "Noisesus0" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noisesus[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels.type')" == *${noisesus[2]}* ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${noisesus[3]} ]]; then
      # echo "Noisesus1" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noisesus[0]}
  fi
  ##############################
  # Noise impulse
  if [ ! -d "$base/${noiseimp[0]}" ]; then
      mkdir "$base/${noiseimp[0]}"
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${noiseimp[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${noiseimp[3]} ]]; then
      # echo "Noiseimp0" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noiseimp[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels.type')" == *${noiseimp[2]}* ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${noiseimp[3]} ]]; then
      # echo "Noiseimp1" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noiseimp[0]}
  fi
  ##############################
  # Noise iteration
  if [ ! -d "$base/${noiseiter[0]}" ]; then
      mkdir "$base/${noiseiter[0]}"
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${noiseiter[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${noiseiter[3]} ]]; then
      # echo "Noiseiter0" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noiseiter[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels.type')" == *${noiseiter[2]}* ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${noiseiter[3]} ]]; then
      # echo "Noiseiter1" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noiseiter[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${noiseiter[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${noiseiter[4]} ]]; then
      # echo "Noiseiter2" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${noiseiter[0]}
  fi
#+end_src

#+RESULTS:
#+name: vacillating_row
#+begin_src shell :noweb yes
  ##############################
  # Noise sustain
  if [ ! -d "$base/${vacillatingsus[0]}" ]; then
      mkdir "$base/${vacillatingsus[0]}"
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == ${vacillatingsus[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${vacillatingsus[3]} ]]; then
      # echo "Vacillatingsus0" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${vacillatingsus[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == *${vacillatingsus[1]}* ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${vacillatingsus[2]} ]]; then
      # echo "Vacillatingsus1" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${vacillatingsus[0]}
  fi
  ##############################
  # Noise impulse
  if [ ! -d "$base/${compositeimp[0]}" ]; then
      mkdir "$base/${compositeimp[0]}"
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${compositeimp[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${compositeimp[3]} ]]; then
      # echo "Compositeimp0" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${compositeimp[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == *${compositeimp[2]}* ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${compositeimp[3]} ]]; then
      # echo "Compositeimp1" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${compositeimp[0]}
  fi
  ##############################
  # Noise iteration
  if [ ! -d "$base/${compositeiter[0]}" ]; then
      mkdir "$base/${compositeiter[0]}"
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${compositeiter[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${compositeiter[4]} ]]; then
      # echo "Compositeiter0" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${compositeiter[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels."mass-type"')" == *${compositeiter[2]}* ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${compositeiter[3]} ]]; then
      # echo "Compositeiter1" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${compositeiter[0]}
  fi
  if  [[ "$(cat "$j" | jq -r '.object.labels.sustain')" == ${compositeiter[1]} ]] &&
      	[[ "$(cat "$j" | jq -r '.object.labels."pulse-typology"')" == ${compositeiter[3]} ]]; then
      # echo "Compositeiter2" "$d""`cat "$j" | jq -r '.object.filename'`"
      cp "$d""`cat "$j" | jq -r '.object.filename'`" $base/${compositeiter[0]}
  fi

#+end_src

** Current directory
#+begin_src python :results value output
    import os
    cwd = os.path.join(os.getcwd(), "code.org")
    file = print(os.path.basename(cwd))
    print(cwd)
#+end_src

#+RESULTS:
: code.org
: /Volumes/Freedom/Dropbox/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/stuff/code.org

** Compare strings
#+begin_src python :results value output
import os
dir = os.getcwd()
print(dir)
file = os.path.join(dir, '../classification/training_data/testing/N1_impulse.wav')
print(os.path.basename(file))
if('N0' in os.path.basename(file)):
     print("yes")

#+end_src

#+RESULTS:
: /Volumes/Freedom/Dropbox/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/stuff
: N1_impulse.wav

** Stuff
#+begin_src python :results value output
  import os
  import glob
  directory = "/Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data"
  extension = "*.wav"

  for audio_file in glob.glob(os.path.join(directory, extension)):
          print(f"Found audio file {audio_file}")      
#+end_src

#+RESULTS:
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/pluck.wav
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/imp_005.wav
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/rhythm.wav
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/tone.wav
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/fsustain-1.wav
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/iter_009.wav
: Found audio file /Users/henrik_frisk/Documents/kmh/forskning/applications/KK/KKS 2022 IRESAP/audio_classification/classification/training_data/noise.wav
